src/InformationRegisters/IndividualDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>IndividualDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Issuer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IdentityDocumentKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/IndividualDocuments/Forms/DocumentsOfIndividual/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURES - FORM EVENTS HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	If Parameters.Filter.Property("Individual") Then
		Individual = Parameters.Filter.Individual;
		
		PersonIdentity = InformationRegisters.IndividualDocuments.DocumentCertifyingPersonalityOfInd(Individual);
		
		IsIdentity = Not IsBlankString(PersonIdentity);
		
		Items.PersonIdentity.Height	= ?(IsIdentity, 2, 0);
		PersonIdentity 				= ?(IsIdentity, "Personal ID: ", "") + PersonIdentity;
		
		Query = New Query;
		Query.SetParameter("Individual",	Individual);
		Query.Text =
		"SELECT TOP 1
		|	IndividualDocuments.Presentation
		|FROM
		|	InformationRegister.IndividualDocuments AS IndividualDocuments
		|WHERE
		|	IndividualDocuments.Individual = &Individual";
		AreDocuments = Not Query.Execute().IsEmpty();
		
		If Not IsIdentity And AreDocuments Then
			Items.NoIdentity.Visible = True;
			TextOfMessage = NStr("en = 'For the individual %1 the ID document has not been set up.'");
			PersonIdentity = StringFunctionsClientServer.SubstitureParametersInString(TextOfMessage, Individual);
		EndIf;
		
		Items.PersonIdentity.Visible = Not IsBlankString(PersonIdentity);
	EndIf;
	
EndProcedure
